IDEA Open Model
Segment2D Constructor
Compatible with IDEA StatiCa 20.1
Initializes a new instance of the Segment2D class
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
protected Segment2D()
Protected Sub New
See Also
Reference
Segment2D Class
IdeaRS.OpenModel.Geometry2D Namespace